In [1]:
no <- c(1,2,3,4)
name <- c('apple','banana','peach','berry')
prices <- c(500,200,200,50)
qty <- c(5,2,7,9)

In [2]:
#데이터프레임(2아원 표형식의 데이터)
#data.frame(필드명=벡터)
fruit <- data.frame(No=no, Name=name, Price=prices, QTY=qty)
fruit

  No Name   Price QTY
1 1  apple  500   5
2 2  banana 200   2
3 3  peach  200   7
4 4  berry   50   9

In [3]:
ls() #현재 사용중인 변수 목록

[1] "fruit"  "name"   "no"     "prices" "qty"

In [4]:
#파일로 저장 , 바이너리 파일
save(no,name,fruit,file='d:/data/R/test.dat')

In [5]:
rm(fruit,no,name) #변수 삭제
ls() #변수목록
no #에러발생
name
fruit

[1] "prices" "qty"

ERROR: Error in eval(expr, envir, enclos): 객체 'no'를 찾을 수 없습니다

In [6]:
load('d:/data/R/test.dat')
ls() #변수 목록
no
name
fruit

[1] "fruit"  "name"   "no"     "prices" "qty"

[1] 1 2 3 4

[1] "apple"  "banana" "peach"  "berry"

  No Name   Price QTY
1 1  apple  500   5
2 2  banana 200   2
3 3  peach  200   7
4 4  berry   50   9

In [7]:
#csv파일 읽기
x <- read.csv('d:/data/R/a.csv')
x

  id name   score
1 1  김철수 80
2 2  박철호 90
3 3  송기성 50

In [8]:
str(x) #데이터의 구조 확인

'data.frame':	3 obs. of  3 variables:
 $ id   : int  1 2 3
 $ name : Factor w/ 3 levels "김철수","박철호",..: 1 2 3
 $ score: int  80 90 50

In [9]:
xx <-read.csv('d:/data/R/a.csv',header=F)
xx
names(xx)<-c('id','name','score')
xx

  V1 V2     V3
1 id name   score
2 1  김철수 80
3 2  박철호 90
4 3  송기성 50

  id name   score
1 id name   score
2 1  김철수 80
3 2  박철호 90
4 3  송기성 50

In [12]:
xx <-read.csv('d:/data/R/b.csv',header=F)
xx
names(xx)<-c('id','name','score')
xx

  V1 V2     V3
1 1  김철수 80
2 2  박철호 90
3 3  송기성 50

  id name   score
1 1  김철수 80
2 2  박철호 90
3 3  송기성 50

In [13]:
no<-c(1,2,3,4)
name<-c('Apple','Banana','Peach','Berry')
prices<-c(500,200,200,50)
qty<-c(5,2,7,9)
fruit<-data.frame(No=no,Name=name,Price=prices,QTY=qty)
fruit

  No Name   Price QTY
1 1  Apple  500   5
2 2  Banana 200   2
3 3  Peach  200   7
4 4  Berry   50   9

In [15]:
write.csv(fruit, file='d:/data/R/fruit.csv')

In [2]:
#텍스트 파일 불러오기
#what 다양한 자료형
a <- scan('d:/data/R/test.txt',what='',fileEncoding='utf-8')
a
a[4]
str(a)
# 텍스트 파일을 읽어서 표 형식으로 변환, header=T 헤더 표시
# sep 필드 구분자, 파일인코딩형식이 utf-8인 경우 fileEncoding 추가
c<-read.table('d:/data/R/test.txt',header=T, sep=' ',fileEncoding='utf-8')
c

 [1] "no"     "name"   "birth"  "11"     "조광수" "1980"   "22"     "김철수"
 [9] "1990"   "33"     "나상호" "2000"

[1] "11"

 chr [1:12] "no" "name" "birth" "11" "조광수" "1980" "22" "김철수" "1990" ...

  no name   birth
1 11 조광수 1980
2 22 김철수 1990
3 33 나상호 2000